Repository: ahmed250658/school_Project
Catalog: school_Project.Core/Shared/SharedResource.*.resx
Languages: ar

# Required
source: This Field is Reqired
ar: هذا الحقل مطلوب

# NotFound
source: This Object Is Not Found
ar: هذا المستخدم غير موجود

# Deleted
source: Delete Successfuly
ar: تم الحذف بنجاح

# Created
source: Created Successfuly
ar: تم الاضافة بنجاح

# Updated
source: Updated Successfuly
ar: تم التعديل بنجاح

# Sucess
source: Added Successfuly
ar: تم الاضافة بنجاح

# UnAuthroized
source: You are not Authrized To Access This Resources
ar: لا تملك صلاحيه للوصول لتلك المصادر

# BadRequest
source: Request Can't be Understand
ar: هذا الطلب لايمكن فهمه

# UnprocessableEntity
source: There are Validation Erros Or Syntax Errors
ar: يوجد مشاكل في صيغة الداتا أو نوعها عن المطلوب

# MaxLengthis100
source: The Max Lenght Is 100
ar: يجب الا يزيد هذا النص عن 100

# IsExist
source: Is Already Exist
ar: موجود بالفعل

# NotEmpty
source: Must Not Empty
ar: لا يمكن ترك العنصر فارغ

# DepartmentIdNotIsExist
source: Department Is Not Exist
ar: رقم القسم غير موجود

# PasswordNotEquelConfrimPassword
source: ConfrimPassword Not Equel Password
ar: الباسورد غير مطابق

# EmailIsExist
source: This Email Is Already Exist
ar: هذا الايميل موجود بالفعل

# FaildAddUser
source: failed Add User
ar: حدث خطأ اثناء أضافة المستخدم

# UpdateFailed
source: Update Opreation Failed
ar: حدث خطأ اثناء عملية التعديل

# DeleteFailed
source: Delete Opreation Failed
ar: حدث خطأ اثناء عملية الحذف

source: Change Password Failed
ar: حدث خطأ أثناء عملية تغيير الباسورد

# PasswordIsNotExist
source: This password Is Not Correct
ar: هذا الباسورد غير صحيح

source: Algorithm Is Wrong
ar: هناك خطأ في الخوارزمية المستخدمة في التشفير

source: Token Is Not Expired
ar: رمز الوصول الذي تستخدمة ليس منتهي

source: Refresh Token Is Not Found
ar: رمز التنشيط الذي تستخمه ليس موجود

source: Refresh Token Is Expired
ar: رمز التنشيط الذي تستخمه انتهت صلاحية

source: Token Is Expired
ar: رمز الوصول الذي تستخدمة ليس منتهي

# AddFaild
source: Add Is Faild
ar: حدث خطأ في الاضافة

# RoleIsNotExist
source: This Role Is Not Exist
ar: هذا الصلاحيه غير موجوده

# RoleIsUsed
source: This Role Is Already Use
ar: هذه الصالحيه مستخدمه بالفعل

source: Email
ar: الايميل

source: Message
ar: الرساله

# SendEmailFaild
source: Operation To Send Email Failed
ar: حدث خطأ أثناء أرسال الايميل

# ComfirmEmail
source: Please Confirm Email
ar: من فضلك قم بتأكد الايميل

source: UserName Is Exist
ar: الاسم مستخدم بالفعل

source: TryTo Register Again
ar: حاول التسجيل مرة أخري

source: Error When Confirm Email
ar: حدث خطأ أثناء عملية تأكيد الايميل

source: Confirm Email Done
ar: نجحت عملية تأكيد الايميل

source: Faild Remove Old Role
ar: القديمهRoleفشل حذف ال

source: Faild Add New Role
ar: الجديدةRoleفشل في اضافةال

source: Try Again
ar: حاول مره اخري في وقت لاحق

source: Invaild Code
ar: هذا الكود عير صحيح

# FailedToUpload
source: Failed To Upload Image
ar: فشل في تحميل الصورة,الرجاء اعاده المحاوله

# NoImage
source: please,select Image
ar: من فضلك قم بأختيار صوره
